Revit 2027 API
IPerformanceAdviserRule.WillCheckElements Method
 Reports if rule needs to be executed on individual elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
bool WillCheckElements()
Function WillCheckElements As Boolean
bool WillCheckElements()
abstract WillCheckElements : unit -> bool
Return Value
Boolean
 True if rule needs to be executed on individual elements.
See Also
Reference
IPerformanceAdviserRule Interface
Autodesk.Revit.DB Namespace